from ..modeling import APIEnvelope

# ============================================================
# 1️⃣ Изменить тип продукта карты
# ============================================================


class SetCardProductResponse(APIEnvelope[list[str]]):
    """
    Ответ на запрос изменения типа продукта карты (setCardProduct).
    Пример ответа:
    {
        "status": {"code": 200},
        "data": ["11148025"],
        "timestamp": 1596024392
    }
    """


# ============================================================
# 2️⃣ Перевести деньги с договора на кошелёк
# ============================================================


class MoveToCardResponse(APIEnvelope[bool]):
    """
    Ответ на запрос перевода денег с договора на карту-кошелёк (moveToCard).
    Пример ответа:
    {
        "status": {"code": 200},
        "data": true,
        "timestamp": 1596024392
    }
    """


# ============================================================
# 3️⃣ Перевести деньги с кошелька на договор
# ============================================================


class MoveToContractResponse(APIEnvelope[bool]):
    """
    Ответ на запрос перевода денег с кошелька на договор (moveToContract).
    Пример ответа:
    {
        "status": {"code": 200},
        "data": true,
        "timestamp": 1596024392
    }
    """
